# FamilyConnectorDeletedError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FamilyConnectorDeletedError Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The family Connector has been modified so the connection is invalid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyConnectorDeletedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyConnectorDeletedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyConnectorDeletedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace